بسم الله الرحمن الرحيم

قررت أرجّع النشاط شوية على LinkedIn، والمرة دي البوست مش من النوع “المثالي” اللي كله بيحاول يبان فيه بصورة 100% كاملة…
البوست ده مختلف شوية 🙂

الفترة اللي فاتت كانت رحلة قصيرة حاولت فيها أبدأ طريقي في مجال Cyber Security بطريقة صحيحة ومضمونة – قدر الإمكان – إن شاء الله.
وخلال الرحلة دي، كانت فيها محاولات اتقبلت فيها ومحاولات اترفضت فيها…
بس الحقيقة إن الرفض كان له فضل كبير في إني أتعلم وأراجع نفسي وأطور من طريقتي.

لأن في النهاية، المذاكرة لوحدك كويسة جدًا، لكن وجودك وسط منحة أو Community بيساعدك تتطور أسرع، وبيفتحلك آفاق جديدة.

والحمد لله 🙏
اتقبلت في منحة بناة مصر الرقمية 🇪🇬
وحبيت أشارك التجربة بتفاصيلها:

🔹 اختبار الـ IQ: كان صعب لكن ممتع جدًا.
🔹 اختبار اللغة الإنجليزية (EN): 100 سؤال ممتازين ومتنوعين.
🔹 الاختبار التقني (Technical Exam): مستوى متوسط، ركّز أكتر على مفاهيم زي الـ Encryption و الـ Hashing.
🔹 الإنترفيو (Interview): من أحسن المقابلات اللي حضرتها، كانت تجربة مفيدة ومريحة جدًا،
وتضمنت أسئلة عن الشبكات والأساسيات العامة في مجال الـ Cyber Security.

🎯 الخلاصة:
القبول أو الرفض مش مقياس إنك “أفضل” أو “أقل”، لكنه توفيق من ربنا سبحانه وتعالى،
وكل تجربة – سواء قبول أو رفض – هي خطوة في الطريق اللي مكتوب ليك توصله في الوقت الصح 💫

بالتوفيق لكل حد لسه بيبدأ أو بيكمّل الرحلة 💪✨